#+TITLE:     Work SOP
#+AUTHOR:    fatfingererr - www.ffe.tw
#+EMAIL:     (concat "fatfingererr" at-sign "gmail.com")
#+DATE:      2015-01-23
#+LANGUAGE:  zh-TW
#+OPTIONS:   H:4 num:nil toc:2
#+SETUPFILE: theme-readtheorg.setup
#+STARTUP: showall
#+begin_EXPORT html
<script src="js/mathjax/MathJax.js?config=TeX-AMS-MML_HTMLorMML,local/local" type="text/javascript"></script>
<div class="right"><a href="https://github.com/fatfingererr/note/XXXXXXXX.org" class="fa fa-github">GitHub</a></div>
#+end_EXPORT


-----
* Notice

- 目前以將舊框架拆成多個小repo方式進行
- 請開啟 80 字元限制線 ( M-m t l )


* Today
** 2017-02-06 Mon
***** look clockwork RNN


***** 



* 工作流

- 先到 Work layout
  - 確認 Annual Plan (annual.org) 目前的目標
  - 再到 diary logbook (diary.org) 看上次未完成的項目
  - 到 work page (work.org<note>) 中 Today 插入 WPTP 模板
    - 根據今日狀況安排 TODO 並排優先順序並新增至 Work 記得切到小藍點
- 切到 Work-MATLAB layout
  - 先注意 Work page 的 Notice 並更新
  - 每項工作開始前先 clock-in 產生 :LOGBOOK:
    - 每項更屋做應 log 在該項目底下, 以日期時間 + 敘述紀錄

** 工作結束前
- git push 各個分支
- 檢查所有註解的 TODO ( 可用 Matlab 搜尋 )


* 快捷鍵

** 常用目錄

#+BEGIN_SRC emacs-lisp
(dired (concat user-path "LSTM"))
(dired "C:\\Users\\rcwan\\LSTM\\")
(dired mt4-dir)
(dired mt4-terminal-dir)
(dired (concat mt4-terminal-dir "MQL4\\Experts"))
#+END_SRC


#+BEGIN_SRC emacs-lisp
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
#+END_SRC
        



** 常用指令 ( 請用 C-x C-e 執行 )
#+BEGIN_SRC emacs-lisp
;; XXXX-dir 請到 user-config 設定
(async-shell-command (concat "cd " XXXX-dir " && <cmd>")
; C:\Users\rcwan\AppData\Roaming\MetaQuotes\Terminal\2010C2441A263399B34F537D91A53AC9\MQL4\Experts
#+END_SRC

*** 開啟 MATLAB

#+BEGIN_SRC emacs-lisp
(call-process-shell-command "matlab" nil 0)
#+END_SRC

*** 開啟 HPC Cluster Manager

#+BEGIN_SRC emacs-lisp
(call-process-shell-command HPC-cluster-manager nil 0)
#+END_SRC

*** 開啟工作流

#+BEGIN_SRC emacs-lisp
(call-process-shell-command (concat "start chrome "  note-dir "\\work.html"))
#+END_SRC


-----
* 基本操作

** 操作一

** 操作二



-----
* 工作材料

** 材料一

** 材料二

** 材料三



-----
* snippet


-----
* memo

-----
* todo

** TODO [#A] LSTM rolling / Metatrder Rolling 
*** model class
*** [#A] fetch data and analysis
**** TODO dev analysis code
     :LOGBOOK:
     CLOCK: [2017-01-24 週二 12:40]--[2017-01-24 週二 13:01] =>  0:21
     :END:

** TODO [#A] LSTM merge original dev framework
*** model class
*** diff insample 
*** train report 
*** send message

** TODO write utility function
*** DONE creaete repo
    CLOSED: [2017-01-24 週二 14:46]
    :LOGBOOK:
    CLOCK: [2017-01-24 週二 14:33]--[2017-01-24 週二 14:46] =>  0:13
    :END:
*** TODO merge old function
    :LOGBOOK:
    CLOCK: [2017-01-24 週二 14:46]--[2017-01-24 週二 15:45] =>  0:59
    :END:
*** TODO write some basic useage and information & use snippet


** TODO [#B] LSTM auto run job 

** TODO [#C] clockwork 

** TODO [#B] sizeX , nX 

** [[https://github.com/mobeets/mpm][GitHub - mobeets/mpm: Simple Matlab package management inspired by pip]]

** [[https://www.npmjs.com/package/matpack][matpack]]

** gitlab DNS problem


